{
    "data": [
        {
            "title": "Điều 1 36/2005/QH11 thương mại",
            "paragraphs": [
                {
                    "context": "Phạm vi điều chỉnh 1. Hoạt động thương mại thực hiện trên lãnh thổ nước Cộng hoà xã hội chủ nghĩa Việt Nam. 2. Hoạt động thương mại thực hiện ngoài lãnh thổ nước Cộng hoà xã hội chủ nghĩa Việt Nam trong trường hợp các bên thoả thuận chọn áp dụng Luật này hoặc luật nước ngoài, điều ước quốc tế mà Cộng hoà xã hội chủ nghĩa Việt Nam là thành viên có quy định áp dụng Luật này. 3. Hoạt động không nhằm mục đích sinh lợi của một bên trong giao dịch với thương nhân thực hiện trên lãnh thổ nước Cộng hoà xã hội chủ nghĩa Việt Nam trong trường hợp bên thực hiện hoạt động không nhằm mục đích sinh lợi đó chọn áp dụng Luật này.",
                    "qas": [
                        {
                            "id": "126f84eec54e776694806004ff470773",
                            "question": "định nghĩa phạm vi điều chỉnh trong điều khoản xã hội chủ nghĩa Việt Nam?"
                        },
                        {
                            "id": "d8a2208d9376991f261f27ea1958a1a9",
                            "question": "định nghĩa pháp lý về phạm vi điều chỉnh?"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Điều 2 36/2005/QH11 thương mại",
            "paragraphs": [
                {
                    "context": "Đối tượng áp dụng 1. Thương nhân hoạt động thương mại theo quy định tại Điều 1 của Luật này. 2. Tổ chức, cá nhân khác hoạt động có liên quan đến thương mại. 3. Căn cứ vào những nguyên tắc của Luật này, Chính phủ quy định cụ thể việc áp dụng Luật này đối với cá nhân hoạt động thương mại một cách độc lập, thường xuyên không phải đăng ký kinh doanh.",
                    "qas": [
                        {
                            "id": "f9ac27130a86f4dc3063aa74d771ebb4",
                            "question": "bạn cần thương nhân để làm gì?"
                        },
                        {
                            "id": "e2dfc0ab9bfdb003ac4d4c87257cb7ab",
                            "question": "đối tượng áp dụng của luật thương mại là gì?"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Điều 3 36/2005/QH11 thương mại",
            "paragraphs": [
                {
                    "context": "Trong Luật này, các từ ngữ dưới đây được hiểu như sau: 1. Hoạt động thương mại là hoạt động nhằm mục đích sinh lợi, bao gồm mua bán hàng hoá, cung ứng dịch vụ, đầu tư, xúc tiến thương mại và các hoạt động nhằm mục đích sinh lợi khác. 2. Hàng hóa bao gồm: a) Tất cả các loại động sản, kể cả động sản hình thành trong tương lai; b) Những vật gắn liền với đất đai. 3. Thói quen trong hoạt động thương mại là quy tắc xử sự có nội dung rõ ràng được hình thành và lặp lại nhiều lần trong một thời gian dài giữa các bên, được các bên mặc nhiên thừa nhận để xác định quyền và nghĩa vụ của các bên trong hợp đồng thương mại. 4. Tập quán thương mại là thói quen được thừa nhận rộng rãi trong hoạt động thương mại trên một vùng, miền hoặc một lĩnh vực thương mại, có nội dung rõ ràng được các bên thừa nhận để xác định quyền và nghĩa vụ của các bên trong hoạt động thương mại. 5. Thông điệp dữ liệu là thông tin được tạo ra, gửi đi, nhận và lưu giữ bằng phương tiện điện tử. 6. Văn phòng đại diện của thương nhân nước ngoài tại Việt Nam là đơn vị phụ thuộc của thương nhân nước ngoài, được thành lập theo quy định của pháp luật Việt Nam để tìm hiểu thị trường và thực hiện một số hoạt động xúc tiến thương mại mà pháp luật Việt Nam cho phép. 7. Chi nhánh của thương nhân nước ngoài tại Việt Nam là đơn vị phụ thuộc của thương nhân nước ngoài, được thành lập và hoạt động thương mại tại Việt Nam theo quy định của pháp luật Việt Nam hoặc điều ước quốc tế mà Cộng hòa xã hội chủ nghĩa Việt Nam là thành viên. 8. Mua bán hàng hoá là hoạt động thương mại, theo đó bên bán có nghĩa vụ giao hàng, chuyển quyền sở hữu hàng hóa cho bên mua và nhận thanh toán; bên mua có nghĩa vụ thanh toán cho bên bán, nhận hàng và quyền sở hữu hàng hoá theo thỏa thuận. 9. Cung ứng dịch vụ là hoạt động thương mại, theo đó một bên (sau đây gọi là bên cung ứng dịch vụ) có nghĩa vụ thực hiện dịch vụ cho một bên khác và nhận thanh toán; bên sử dụng dịch vụ (sau đây gọi là khách hàng) có nghĩa vụ thanh toán cho bên cung ứng dịch vụ và sử dụng dịch vụ theo thỏa thuận. 10. Xúc tiến thương mại là hoạt động thúc đẩy, tìm kiếm cơ hội mua bán hàng hoá và cung ứng dịch vụ, bao gồm hoạt động khuyến mại, quảng cáo thương mại, trưng bày, giới thiệu hàng hoá, dịch vụ và hội chợ, triển lãm thương mại. 11. Các hoạt động trung gian thương mại là hoạt động của thương nhân để thực hiện các giao dịch thương mại cho một hoặc một số thương nhân được xác định, bao gồm hoạt động đại diện cho thương nhân, môi giới thương mại, uỷ thác mua bán hàng hoá và đại lý thương mại. 12. Vi phạm hợp đồng là việc một bên không thực hiện, thực hiện không đầy đủ hoặc thực hiện không đúng nghĩa vụ theo thoả thuận giữa các bên hoặc theo quy định của Luật này. 13. Vi phạm cơ bản là sự vi phạm hợp đồng của một bên gây thiệt hại cho bên kia đến mức làm cho bên kia không đạt được mục đích của việc giao kết hợp đồng. 14. Xuất xứ hàng hoá là nước hoặc vùng lãnh thổ nơi sản xuất ra toàn bộ hàng hoá hoặc nơi thực hiện công đoạn chế biến cơ bản cuối cùng đối với hàng hoá trong trường hợp có nhiều nước hoặc vùng lãnh thổ tham gia vào quá trình sản xuất hàng hoá đó. 15. Các hình thức có giá trị tương đương văn bản bao gồm điện báo, telex, fax, thông điệp dữ liệu và các hình thức khác theo quy định của pháp luật.",
                    "qas": [
                        {
                            "id": "b4ea7047457b27c891fdf6dd5c848c87",
                            "question": "làm thế nào để biết nếu một công ty có cần thiết cho các tổ chức thương mại và các nhóm không??"
                        },
                        {
                            "id": "a408f06eae198d86bbadb8c134366420",
                            "question": "xác định hoạt động thương mại?"
                        }
                    ]
                }
            ]
        }
    ]
}